In [1]:
# Dependencies
import pandas as pd

In [2]:
# Save path to data set in a variable
data_file = "Resources/dataSet.csv"

In [3]:
# Use Pandas to read data
data_file_df = pd.read_csv(data_file)
data_file_df.head()

   id           Full Name  Gender   Amount       Car
0   1        Minnnie Rean    male  15484.5      Jeep
1   2     Ursa Torricella  female  13443.3    Saturn
2   3     Joyann Pirolini    male   9095.6       Ram
3   4      Sharl Ridsdell  female  11871.6     Dodge
4   5  Laurence Jovasevic    male  13459.8  Chrysler

In [4]:
# Display a statistical overview of the DataFrame
data_file_df.describe()

                id        Amount
count  1000.000000   1000.000000
mean    500.500000   9988.738100
std     288.819436   5783.375372
min       1.000000     15.300000
25%     250.750000   5043.150000
50%     500.500000   9899.500000
75%     750.250000  15044.225000
max    1000.000000  19927.900000

In [5]:
# Reference a single column within a DataFrame
data_file_df["Amount"].head()

0    15484.5
1    13443.3
2     9095.6
3    11871.6
4    13459.8
Name: Amount, dtype: float64

In [6]:
# Reference multiple columns within a DataFrame
data_file_df[["Amount", "Gender"]].head()

    Amount  Gender
0  15484.5    male
1  13443.3  female
2   9095.6    male
3  11871.6  female
4  13459.8    male

In [7]:
# The mean method averages the series
average = data_file_df["Amount"].mean()
average

9988.738099999993

In [8]:
# The sum method adds every entry in the series
total = data_file_df["Amount"].sum()
total

9988738.100000001

In [9]:
# The unique method shows every element only once
unique = data_file_df["Car"].unique()
unique

array(['Jeep', 'Saturn', 'Ram', 'Dodge', 'Chrysler', 'Cadillac',
       'Pontiac', 'Nissan', 'Lexus', 'Volkswagen', 'Suzuki', 'Kia',
       'Mercury', 'Audi', 'Bugatti', 'BMW', 'Mazda', 'GMC', 'Ford',
       'Mercedes-Benz', 'Land Rover', 'Chevrolet', 'Toyota', 'Honda',
       'Subaru', 'Oldsmobile', 'MINI', 'Lincoln', 'Mitsubishi', 'Isuzu',
       'Infiniti', 'Eagle', 'Saab', 'Buick', 'Volvo', 'Lotus', 'Maserati',
       'Jensen', 'Hyundai', 'Maybach', 'Corbin', 'Acura', 'Ferrari',
       'Plymouth', 'Studebaker', 'Jaguar', 'Rolls-Royce', 'Aston Martin',
       'Merkur', 'CitroÃ«n', 'Daewoo', 'Tesla', 'Porsche', 'Scion', 'Geo',
       'Hummer', 'Lamborghini', 'Fiat', 'Bentley', 'Peugeot', 'Austin',
       'Spyker'], dtype=object)

In [10]:
# The value_counts method counts unique values in a column
count = data_file_df["Gender"].value_counts()
count

male          455
female        446
non-binary     99
Name: Gender, dtype: int64

In [11]:
# Calculations can also be performed on Series and added into DataFrames as new columns
thousands_of_dollars = data_file_df["Amount"]/1000
data_file_df["Thousands of Dollars"] = thousands_of_dollars

data_file_df.head()

   id           Full Name  Gender   Amount       Car  Thousands of Dollars
0   1        Minnnie Rean    male  15484.5      Jeep               15.4845
1   2     Ursa Torricella  female  13443.3    Saturn               13.4433
2   3     Joyann Pirolini    male   9095.6       Ram                9.0956
3   4      Sharl Ridsdell  female  11871.6     Dodge               11.8716
4   5  Laurence Jovasevic    male  13459.8  Chrysler               13.4598